apache/nuttx/arch/arm/src/s32k1xx/s32k1xx_edma.c
  up_clean_dcache((uintptr_t)tcd,
                  (uintptr_t)tcd + sizeof(struct s32k1xx_edmatcd_s));
#else
  /* Scatter/gather DMA is NOT supported */

  /* Check if eDMA is busy: if the channel has started transfer, CSR will be
   * non-zero.
   */

  regaddr  = S32K1XX_EDMA_TCD_CSR(dmach->chan);
  regval16 = getreg16(regaddr);

  if (regval16 != 0 && (regval16 & EDMA_TCD_CSR_DONE) == 0)
    {
      return -EBUSY;
    }

  /* Configure channel TCD registers to the values specified in config. */

  s32k1xx_tcd_configure((struct s32k1xx_edmatcd_s *)
                        S32K1XX_EDMA_TCD_BASE(dmach->chan), config);

  /* Enable the DONE interrupt when the major iteration count completes. */

  regaddr         = S32K1XX_EDMA_TCD_CSR(dmach->chan);
  modifyreg16(regaddr, 0, EDMA_TCD_CSR_INTMAJOR);
#endif

  /* Set the DMAMUX source and enable and optional trigger */

  putreg8(dmach->dmamux, S32K1XX_DMAMUX_CHCFG(dmach->chan));

  dmach->state = S32K1XX_DMA_CONFIGURED;
  return OK;
}

/****************************************************************************
 * Name: s32k1xx_dmach_start
 *
 * Description:
 *   Start the DMA transfer.  This function should be called after the final
 *   call to s32k1xx_dmach_xfrsetup() in order to avoid race conditions.
 *
 *   At the conclusion of each major DMA loop, a callback to
 *   the user-provided function is made: For "normal" DMAs, this will
 *   correspond to the DMA DONE interrupt; for scatter gather DMAs,
 *   this will be generated with the final TCD.
 *
 *   At the conclusion of the DMA, the DMA channel is reset, all TCDs are
 *   freed, and the callback function is called with the success/fail
 *   result of the DMA.
 *
 *   NOTE: On Rx DMAs (peripheral-to-memory or memory-to-memory), it is
 *   necessary to invalidate the destination memory.  That is not done
 *   automatically by the DMA module.  Invalidation of the destination memory
 *   regions is the responsibility of the caller.
 *
 * Input Parameters:
 *   handle   - DMA channel handle created by s32k1xx_dmach_alloc()
 *   callback - The callback to be invoked when the DMA is completes or is
 *              aborted.
 *   arg      - An argument that accompanies the callback
 *
 * Returned Value:
 *   Zero (OK) is returned on success; a negated errno value is returned on
 *   any failure.
 *
 ****************************************************************************/

int s32k1xx_dmach_start(DMACH_HANDLE handle, edma_callback_t callback,
                        void *arg)
{
  struct s32k1xx_dmach_s *dmach = (struct s32k1xx_dmach_s *)handle;
  irqstate_t flags;
  uint8_t regval8;
  uint8_t chan;

  DEBUGASSERT(dmach != NULL && dmach->state == S32K1XX_DMA_CONFIGURED);
  chan            = dmach->chan;
  dmainfo("dmach%u: %p callback: %p arg: %p\n", chan, dmach, callback, arg);

  /* Save the callback info.  This will be invoked when the DMA completes */

  flags           = spin_lock_irqsave(&g_edma.lock);
  dmach->callback = callback;
  dmach->arg      = arg;

#if CONFIG_S32K1XX_EDMA_NTCD > 0
  /* Although it is not recommended, it might be possible to call this
   * function multiple times while adding TCDs on the fly.
   */

  if (dmach->state != S32K1XX_DMA_ACTIVE)
#endif
    {
      dmach->state    = S32K1XX_DMA_ACTIVE;

      /* Enable channel ERROR interrupts */

      regval8         = EDMA_SEEI(chan);
      putreg8(regval8, S32K1XX_EDMA_SEEI);

      /* Enable the DMA request for this channel */

      regval8         = EDMA_SERQ(chan);
      putreg8(regval8, S32K1XX_EDMA_SERQ);
    }

  spin_unlock_irqrestore(&g_edma.lock, flags);
  return OK;
}

/****************************************************************************
 * Name: s32k1xx_dmach_stop
 *
 * Description:
 *   Cancel the DMA.  After s32k1xx_dmach_stop() is called, the DMA channel
 *   is reset, all TCDs are freed, and s32k1xx_dmarx/txsetup() must be called
 *   before s32k1xx_dmach_start() can be called again.
 *
 * Input Parameters:
 *   handle   - DMA channel handle created by s32k1xx_dmach_alloc()
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void s32k1xx_dmach_stop(DMACH_HANDLE handle)
{
  struct s32k1xx_dmach_s *dmach = (struct s32k1xx_dmach_s *)handle;
  irqstate_t flags;

  dmainfo("dmach: %p\n", dmach);
  DEBUGASSERT(dmach != NULL);

  flags = spin_lock_irqsave(&g_edma.lock);
  s32k1xx_dmaterminate(dmach, -EINTR);
  spin_unlock_irqrestore(&g_edma.lock, flags);
}

/****************************************************************************
 * Name: s32k1xx_dmach_getcount
 *
 * Description:
 *   This function checks the TCD (Task Control Descriptor) status for a
 *   specified eDMA channel and returns the number of major loop counts
 *   that have not finished.
 *
 *   NOTES:
 *   1. This function can only be used to get unfinished major loop count of
 *      transfer without the next TCD, or it might be inaccuracy.
 *   2. The unfinished/remaining transfer bytes cannot be obtained directly
 *      from registers while the channel is running.
 *
 *   Because to calculate the remaining bytes, the initial NBYTES configured
 *   in DMA_TCDn_NBYTES_MLNO register is needed while the eDMA IP does not
 *   support getting it while a channel is active.  In another words, the
 *   NBYTES value reading is always the actual (decrementing) NBYTES value
 *   the dma_engine is working with while a channel is running.
 *   Consequently, to get the remaining transfer bytes, a software-saved
 *   initial value of NBYTES (for example copied before enabling the channel)
 *   is needed. The formula to calculate it is shown below:
 *
 *     RemainingBytes = RemainingMajorLoopCount *
 *                      NBYTES(initially configured)
 *
 * Input Parameters:
 *   handle  - DMA channel handle created by s32k1xx_dmach_alloc()
 *
 * Returned Value:
 *   Major loop count which has not been transferred yet for the current TCD.
 *
 ****************************************************************************/

unsigned int s32k1xx_dmach_getcount(DMACH_HANDLE *handle)
{
  struct s32k1xx_dmach_s *dmach = (struct s32k1xx_dmach_s *)handle;
  unsigned int remaining = 0;
  uintptr_t regaddr;
  uint16_t regval16;

  DEBUGASSERT(dmach != NULL);

  /* If the DMA is done, then the remaining count is zero */

  regaddr  = S32K1XX_EDMA_TCD_CSR(dmach->chan);
  regval16 = getreg16(regaddr);

  if ((regval16 & EDMA_TCD_CSR_DONE) == 0)
    {
      /* Calculate the unfinished bytes */

      regaddr  = S32K1XX_EDMA_TCD_CITER_ELINK(dmach->chan);
      regval16 = getreg16(regaddr);

      if ((regval16 & EDMA_TCD_CITER_ELINK) != 0)
        {
          remaining = (regval16 & EDMA_TCD_CITER_ELINK_CITER_MASK) >>
                      EDMA_TCD_CITER_ELINK_CITER_SHIFT;
        }
      else
        {
          remaining = (regval16 & EDMA_TCD_CITER_CITER_MASK) >>
                      EDMA_TCD_CITER_CITER_SHIFT;
        }
    }

  return remaining;
}

/****************************************************************************
 * Name: s32k1xx_dmasample
 *
 * Description:
 *   Sample DMA register contents
 *
 * Assumptions:
 *   - DMA handle allocated by s32k1xx_dmach_alloc()
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_DMA
void s32k1xx_dmasample(DMACH_HANDLE handle, struct s32k1xx_dmaregs_s *regs)
{
  struct s32k1xx_dmach_s *dmach = (struct s32k1xx_dmach_s *)handle;
  uintptr_t regaddr;
  unsigned int chan;
  irqstate_t flags;

  DEBUGASSERT(dmach != NULL && regs != NULL);
  chan           = dmach->chan;
  regs->chan     = chan;

  /* eDMA Global Registers */

  flags          = spin_lock_irqsave(&g_edma.lock);

  regs->cr       = getreg32(S32K1XX_EDMA_CR);   /* Control */
  regs->es       = getreg32(S32K1XX_EDMA_ES);   /* Error Status */
  regs->erq      = getreg32(S32K1XX_EDMA_ERQ);  /* Enable Request */
  regs->req      = getreg32(S32K1XX_EDMA_INT);  /* Interrupt Request */
  regs->err      = getreg32(S32K1XX_EDMA_ERR);  /* Error */
  regs->hrs      = getreg32(S32K1XX_EDMA_HRS);  /* Hardware Request Status */
  regs->ears     = getreg32(S32K1XX_EDMA_EARS); /* Enable Asynchronous Request in Stop */

  /* eDMA Channel registers */

  regaddr        = S32K1XX_EDMA_DCHPRI(chan);
  regs->dchpri   = getreg8(regaddr);          /* Channel priority */

  /* eDMA TCD */

  base           = S32K1XX_EDMA_TCD_BASE(chan);
  regs->saddr    = getreg32(base + S32K1XX_EDMA_TCD_SADDR_OFFSET);
  regs->soff     = getreg16(base + S32K1XX_EDMA_TCD_SOFF_OFFSET);
  regs->attr     = getreg16(base + S32K1XX_EDMA_TCD_ATTR_OFFSET);
  regs->nbml     = getreg32(base + S32K1XX_EDMA_TCD_NBYTES_ML_OFFSET);
  regs->slast    = getreg32(base + S32K1XX_EDMA_TCD_SLAST_OFFSET);
  regs->daddr    = getreg32(base + S32K1XX_EDMA_TCD_DADDR_OFFSET);
  regs->doff     = getreg16(base + S32K1XX_EDMA_TCD_DOFF_OFFSET);
  regs->citer    = getreg16(base + S32K1XX_EDMA_TCD_CITER_ELINK_OFFSET);
  regs->dlastsga = getreg32(base + S32K1XX_EDMA_TCD_DLASTSGA_OFFSET);
  regs->csr      = getreg16(base + S32K1XX_EDMA_TCD_CSR_OFFSET);
  regs->biter    = getreg16(base + S32K1XX_EDMA_TCD_BITER_ELINK_OFFSET);

